seoulOpenFOAMDataset/caseTemplate/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    terrain
    {
        type            slip;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    sides
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}
